# -*- coding: utf-8 -*-

num_classes = 30

weight_file_name = "weights.ckpt"

checkpoint_dir = "checkpoint"

result_dir = "result"

fruit_idx2name = {
    0 : "无花果",
    1 : "西瓜",
    2 : "杏子",
    3 : "芒果",
    4 : "菠萝",
    5 : "草莓",
    6 : "葡萄",
    7 : "石榴",
    8 : "百香果",
    9 : "香蕉",
    10 : "葡萄柚",
    11 : "西红柿",
    12 : "酸橙",
    13 : "哈密瓜",
    14 : "鳄梨",
    15 : "柠檬",
    16 : "桃子",
    17 : "覆盆子",
    18 : "橘子",
    19 : "黑莓",
    20 : "樱桃",
    21 : "阿西罗拉樱桃",
    22 : "李子",
    23 : "橄榄",
    24 : "椰子",
    25 : "蓝莓",
    26 : "猕猴桃",
    27 : "梨",
    28 : "石榴",
    29 : "苹果",
}